tap "databricks/tap"
tap "hashicorp/tap"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source distributed event streaming platform
brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Rainbows and unicorns in your console!
brew "lolcat"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Command-line client for WebSockets
brew "websocat"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Terraform
brew "hashicorp/tap/terraform"
# Command-line interface for 1Password
cask "1password-cli"
# Developer platform
cask "dotnet-sdk"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
